Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.45/samg53/atdf/ATSAMG53G19.atdf
        <register caption="Pad Pull-down Enable Register" name="PIO_PPDER" offset="0x0094" rw="W" size="4" atomic-op="set:PIO_PPDSR">
          <bitfield caption="Pull-Down Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Pull-Down Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Pull-Down Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Pull-Down Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Pull-Down Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Pull-Down Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Pull-Down Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Pull-Down Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Pull-Down Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Pull-Down Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Pull-Down Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Pull-Down Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Pull-Down Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Pull-Down Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Pull-Down Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Pull-Down Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Pull-Down Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Pull-Down Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Pull-Down Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Pull-Down Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Pull-Down Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Pad Pull-down Status Register" name="PIO_PPDSR" offset="0x0098" rw="R" size="4">
          <bitfield caption="Pull-Down Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Pull-Down Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Pull-Down Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Pull-Down Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Pull-Down Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Pull-Down Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Pull-Down Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Pull-Down Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Pull-Down Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Pull-Down Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Pull-Down Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Pull-Down Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Pull-Down Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Pull-Down Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Pull-Down Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Pull-Down Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Pull-Down Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Pull-Down Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Pull-Down Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Pull-Down Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Pull-Down Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Pull-Down Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Pull-Down Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Pull-Down Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Pull-Down Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Pull-Down Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Pull-Down Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Pull-Down Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Pull-Down Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Pull-Down Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Pull-Down Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Pull-Down Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Write Enable" name="PIO_OWER" offset="0x00A0" rw="W" size="4" atomic-op="set:PIO_OWSR">
          <bitfield caption="Output Write Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Write Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Write Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Write Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Write Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Write Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Write Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Write Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Write Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Write Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Write Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Write Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Write Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Write Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Write Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Write Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Write Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Write Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Write Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Write Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Write Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Write Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Write Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Write Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Write Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Write Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Write Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Write Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Write Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Write Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Write Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Write Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Write Disable" name="PIO_OWDR" offset="0x00A4" rw="W" size="4" atomic-op="clear:PIO_OWSR">
          <bitfield caption="Output Write Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Write Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Write Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Write Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Write Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Write Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Write Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Write Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Write Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Write Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Write Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Write Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Write Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Write Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Write Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Write Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Write Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Write Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Write Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Write Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Write Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Write Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Write Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Write Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Write Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Write Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Write Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Write Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Write Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Write Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Write Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Write Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Write Status Register" name="PIO_OWSR" offset="0x00A8" rw="R" size="4">
          <bitfield caption="Output Write Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Write Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Write Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Write Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Write Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Write Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Write Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Write Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Write Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Write Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Write Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Write Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Write Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Write Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Write Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Write Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Write Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Write Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Write Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Write Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Write Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Write Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Write Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Write Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Write Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Write Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Write Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Write Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Write Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Write Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Write Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Write Status" mask="0x80000000" name="P31"/>
        </register>
