Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.45/samg53/atdf/ATSAMG53G19.atdf
      <value-group caption="" name="SUPC_SMMR__SMSMPL">
        <value caption="Supply Monitor disabled" name="SMD" value="0x0"/>
        <value caption="Continuous Supply Monitor" name="CSM" value="0x1"/>
        <value caption="Supply Monitor enables one SLCK period every 32 SLCK periods" name="_32SLCK" value="0x2"/>
        <value caption="Supply Monitor enables one SLCK period every 256 SLCK periods" name="_256SLCK" value="0x3"/>
        <value caption="Supply Monitor enables one SLCK period every 2,048 SLCK periods" name="_2048SLCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMRSTEN">
        <value caption="The core reset signal vddcore_nreset is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The core reset signal vddcore_nreset is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMIEN">
        <value caption="The SUPC interrupt signal is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The SUPC interrupt signal is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODRSTEN">
        <value caption="The core reset signal vddcore_nreset is not affected when a brownout detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The core reset signal vddcore_nreset is asserted when a brownout detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODDIS">
        <value caption="The core brownout detector is enabled." name="ENABLE" value="0"/>
        <value caption="The core brownout detector is disabled." name="DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__OSCBYPASS">
        <value caption="No effect. Clock selection depends on XTALSEL value." name="NO_EFFECT" value="0"/>
        <value caption="The 32 kHz crystal oscillator is bypassed if XTALSEL=1. OSCBYPASS must be set prior to write XTALSEL=1." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__PSWITCH1">
        <value caption="The SRAM1 is not powered." name="OFF" value="0"/>
        <value caption="The SRAM1 is powered." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__PSWITCH2">
        <value caption="The SRAM2 is not powered." name="OFF" value="0"/>
        <value caption="The SRAM2 is powered." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__BODRSTS">
        <value caption="No core brownout rising edge event has been detected since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one brownout output rising edge event has been detected since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMRSTS">
        <value caption="No supply monitor detection has generated a core reset since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one supply monitor detection has generated a core reset since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMS">
        <value caption="No supply monitor detection since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one supply monitor detection since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMOS">
        <value caption="The supply monitor detected VDDIO higher than its threshold at its last measurement." name="HIGH" value="0"/>
        <value caption="The supply monitor detected VDDIO lower than its threshold at its last measurement." name="LOW" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__OSCSEL">
        <value caption="The slow clock SLCK is generated by the embedded 32 kHz RC oscillator." name="RC" value="0"/>
        <value caption="The slow clock SLCK is generated by the 32 kHz crystal oscillator." name="CRYST" value="1"/>
      </value-group>
    </module>
    <module name="TC" caption="Timer Counter" id="6082" version="ZB">
      <register-group name="TC_CHANNEL" size="64">
        <register caption="Channel Control Register (channel = 0)" name="TC_CCR" offset="0x00" rw="W" size="4">
          <bitfield caption="Counter Clock Enable Command" mask="0x00000001" name="CLKEN"/>
          <bitfield caption="Counter Clock Disable Command" mask="0x00000002" name="CLKDIS"/>
          <bitfield caption="Software Trigger Command" mask="0x00000004" name="SWTRG"/>
        </register>
        <register caption="Channel Mode Register (channel = 0)" name="TC_CMR" offset="0x04" rw="RW" size="4">
          <mode name="CAPTURE" qualifier="TC_CMR.WAVE" value="0x0" caption="Capture"/>
          <mode name="WAVEFORM" qualifier="TC_CMR.WAVE" value="0x1" caption="Waveform"/>
          <bitfield caption="Clock Selection" mask="0x00000007" name="TCCLKS" values="TC_CMR0__TCCLKS"/>
          <bitfield caption="Clock Invert" mask="0x00000008" name="CLKI"/>
          <bitfield caption="Burst Signal Selection" mask="0x00000030" name="BURST" values="TC_CMR0__BURST"/>
          <bitfield modes="CAPTURE" caption="Counter Clock Stopped with RB Loading" mask="0x00000040" name="LDBSTOP"/>
          <bitfield modes="WAVEFORM" caption="Counter Clock Stopped with RC Compare" mask="0x00000040" name="CPCSTOP"/>
          <bitfield modes="CAPTURE" caption="Counter Clock Disable with RB Loading" mask="0x00000080" name="LDBDIS"/>
          <bitfield modes="WAVEFORM" caption="Counter Clock Disable with RC Loading" mask="0x00000080" name="CPCDIS"/>
          <bitfield modes="CAPTURE" caption="External Trigger Edge Selection" mask="0x00000300" name="ETRGEDG" values="TC_CMR0__ETRGEDG"/>
          <bitfield modes="WAVEFORM" caption="External Event Edge Selection" mask="0x00000300" name="EEVTEDG" values="TC_CMR0__EEVTEDG"/>
          <bitfield modes="CAPTURE" caption="TIOAx or TIOBx External Trigger Selection" mask="0x00000400" name="ABETRG"/>
          <bitfield modes="WAVEFORM" caption="External Event Selection" mask="0x00000C00" name="EEVT" values="TC_CMR0__EEVT"/>
          <bitfield modes="WAVEFORM" caption="External Event Trigger Enable" mask="0x00001000" name="ENETRG"/>
          <bitfield modes="WAVEFORM" caption="Waveform Selection" mask="0x00006000" name="WAVSEL" values="TC_CMR0__WAVSEL"/>
          <bitfield modes="CAPTURE" caption="RC Compare Trigger Enable" mask="0x00004000" name="CPCTRG"/>
          <bitfield caption="Waveform Mode" mask="0x00008000" name="WAVE"/>
          <bitfield modes="CAPTURE" caption="RA Loading Edge Selection" mask="0x00030000" name="LDRA" values="TC_CMR0__LDRA"/>
          <bitfield modes="WAVEFORM" caption="RA Compare Effect on TIOAx" mask="0x00030000" name="ACPA" values="TC_CMR0__ACPA"/>
          <bitfield modes="CAPTURE" caption="RB Loading Edge Selection" mask="0x000C0000" name="LDRB" values="TC_CMR0__LDRB"/>
          <bitfield modes="WAVEFORM" caption="RC Compare Effect on TIOAx" mask="0x000C0000" name="ACPC" values="TC_CMR0__ACPC"/>
          <bitfield modes="CAPTURE" caption="Loading Edge Subsampling Ratio" mask="0x00700000" name="SBSMPLR" values="TC_CMR0__SBSMPLR"/>
          <bitfield modes="WAVEFORM" caption="External Event Effect on TIOAx" mask="0x00300000" name="AEEVT" values="TC_CMR0__AEEVT"/>
          <bitfield modes="WAVEFORM" caption="Software Trigger Effect on TIOAx" mask="0x00C00000" name="ASWTRG" values="TC_CMR0__ASWTRG"/>
          <bitfield modes="WAVEFORM" caption="RB Compare Effect on TIOBx" mask="0x03000000" name="BCPB" values="TC_CMR0__BCPB"/>
          <bitfield modes="WAVEFORM" caption="RC Compare Effect on TIOBx" mask="0x0C000000" name="BCPC" values="TC_CMR0__BCPC"/>
          <bitfield modes="WAVEFORM" caption="External Event Effect on TIOBx" mask="0x30000000" name="BEEVT" values="TC_CMR0__BEEVT"/>
          <bitfield modes="WAVEFORM" caption="Software Trigger Effect on TIOBx" mask="0xC0000000" name="BSWTRG" values="TC_CMR0__BSWTRG"/>
        </register>
        <register caption="Stepper Motor Mode Register (channel = 0)" name="TC_SMMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Gray Count Enable" mask="0x00000001" name="GCEN"/>
          <bitfield caption="Down Count" mask="0x00000002" name="DOWN"/>
        </register>
        <register caption="Register AB (channel = 0)" name="TC_RAB" offset="0x0C" rw="R" size="4">
          <bitfield caption="Register A or Register B" mask="0xFFFFFFFF" name="RAB"/>
        </register>
