Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.45/samg53/atdf/ATSAMG53G19.atdf
        <register caption="Interrupt Enable Register" name="US_IER" offset="0x0008" rw="W" size="4" atomic-op="set:US_IMR">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
          <bitfield modes="USART" caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield modes="USART" caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield modes="USART" caption="Receiver Break Interrupt Enable" mask="0x00000004" name="RXBRK"/>
          <bitfield modes="USART" caption="End of Receive Buffer Interrupt Enable (available in all USART modes of operation)" mask="0x00000008" name="ENDRX"/>
          <bitfield modes="USART" caption="End of Transmit Buffer Interrupt Enable (available in all USART modes of operation)" mask="0x00000010" name="ENDTX"/>
          <bitfield modes="USART" caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield modes="USART" caption="Framing Error Interrupt Enable" mask="0x00000040" name="FRAME"/>
          <bitfield modes="USART" caption="Parity Error Interrupt Enable" mask="0x00000080" name="PARE"/>
          <bitfield modes="USART" caption="Time-out Interrupt Enable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield modes="USART" caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield modes="USART" caption="Transmit Buffer Empty Interrupt Enable (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE"/>
          <bitfield modes="USART" caption="Receive Buffer Full Interrupt Enable (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF"/>
          <bitfield modes="USART" caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" name="CTSIC"/>
          <bitfield modes="SPI" caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield modes="SPI" caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield modes="SPI" caption="End of Receive Buffer Interrupt Enable" mask="0x00000008" name="ENDRX"/>
          <bitfield modes="SPI" caption="End of Transmit Buffer Interrupt Enable" mask="0x00000010" name="ENDTX"/>
          <bitfield modes="SPI" caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield modes="SPI" caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield modes="SPI" caption="SPI Underrun Error Interrupt Enable" mask="0x00000400" name="UNRE"/>
          <bitfield modes="SPI" caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000800" name="TXBUFE"/>
          <bitfield modes="SPI" caption="Receive Buffer Full Interrupt Enable" mask="0x00001000" name="RXBUFF"/>
          <bitfield modes="SPI" caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event Interrupt Enable" mask="0x00080000" name="NSSE"/>
        </register>
        <register caption="Interrupt Disable Register" name="US_IDR" offset="0x000C" rw="W" size="4" atomic-op="clear:US_IMR">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
          <bitfield modes="USART" caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield modes="USART" caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield modes="USART" caption="Receiver Break Interrupt Enable" mask="0x00000004" name="RXBRK"/>
          <bitfield modes="USART" caption="End of Receive Buffer Interrupt Enable (available in all USART modes of operation)" mask="0x00000008" name="ENDRX"/>
          <bitfield modes="USART" caption="End of Transmit Buffer Interrupt Enable (available in all USART modes of operation)" mask="0x00000010" name="ENDTX"/>
          <bitfield modes="USART" caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield modes="USART" caption="Framing Error Interrupt Enable" mask="0x00000040" name="FRAME"/>
          <bitfield modes="USART" caption="Parity Error Interrupt Enable" mask="0x00000080" name="PARE"/>
          <bitfield modes="USART" caption="Time-out Interrupt Enable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield modes="USART" caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield modes="USART" caption="Transmit Buffer Empty Interrupt Enable (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE"/>
          <bitfield modes="USART" caption="Receive Buffer Full Interrupt Enable (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF"/>
          <bitfield modes="USART" caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" name="CTSIC"/>
          <bitfield modes="SPI" caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield modes="SPI" caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield modes="SPI" caption="End of Receive Buffer Interrupt Enable" mask="0x00000008" name="ENDRX"/>
          <bitfield modes="SPI" caption="End of Transmit Buffer Interrupt Enable" mask="0x00000010" name="ENDTX"/>
          <bitfield modes="SPI" caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield modes="SPI" caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield modes="SPI" caption="SPI Underrun Error Interrupt Enable" mask="0x00000400" name="UNRE"/>
          <bitfield modes="SPI" caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000800" name="TXBUFE"/>
          <bitfield modes="SPI" caption="Receive Buffer Full Interrupt Enable" mask="0x00001000" name="RXBUFF"/>
          <bitfield modes="SPI" caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event Interrupt Enable" mask="0x00080000" name="NSSE"/>
        </register>
        <register caption="Interrupt Mask Register" name="US_IMR" offset="0x0010" rw="R" size="4" atomic-op="read:US_IMR">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
          <bitfield modes="USART" caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield modes="USART" caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield modes="USART" caption="Receiver Break Interrupt Enable" mask="0x00000004" name="RXBRK"/>
          <bitfield modes="USART" caption="End of Receive Buffer Interrupt Enable (available in all USART modes of operation)" mask="0x00000008" name="ENDRX"/>
          <bitfield modes="USART" caption="End of Transmit Buffer Interrupt Enable (available in all USART modes of operation)" mask="0x00000010" name="ENDTX"/>
          <bitfield modes="USART" caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield modes="USART" caption="Framing Error Interrupt Enable" mask="0x00000040" name="FRAME"/>
          <bitfield modes="USART" caption="Parity Error Interrupt Enable" mask="0x00000080" name="PARE"/>
          <bitfield modes="USART" caption="Time-out Interrupt Enable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield modes="USART" caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield modes="USART" caption="Transmit Buffer Empty Interrupt Enable (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE"/>
          <bitfield modes="USART" caption="Receive Buffer Full Interrupt Enable (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF"/>
          <bitfield modes="USART" caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" name="CTSIC"/>
          <bitfield modes="SPI" caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield modes="SPI" caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield modes="SPI" caption="End of Receive Buffer Interrupt Enable" mask="0x00000008" name="ENDRX"/>
          <bitfield modes="SPI" caption="End of Transmit Buffer Interrupt Enable" mask="0x00000010" name="ENDTX"/>
          <bitfield modes="SPI" caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield modes="SPI" caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield modes="SPI" caption="SPI Underrun Error Interrupt Enable" mask="0x00000400" name="UNRE"/>
          <bitfield modes="SPI" caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000800" name="TXBUFE"/>
          <bitfield modes="SPI" caption="Receive Buffer Full Interrupt Enable" mask="0x00001000" name="RXBUFF"/>
          <bitfield modes="SPI" caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event Interrupt Enable" mask="0x00080000" name="NSSE"/>
        </register>
        <register caption="Channel Status Register" name="US_CSR" offset="0x0014" rw="R" size="4">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
          <bitfield modes="USART" caption="Receiver Ready (cleared by reading US_RHR)" mask="0x00000001" name="RXRDY"/>
          <bitfield modes="USART" caption="Transmitter Ready (cleared by writing US_THR)" mask="0x00000002" name="TXRDY"/>
          <bitfield modes="USART" caption="Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000004" name="RXBRK"/>
          <bitfield modes="USART" caption="End of RX Buffer (cleared by writing US_RCR or US_RNCR)" mask="0x00000008" name="ENDRX"/>
          <bitfield modes="USART" caption="End of TX Buffer (cleared by writing US_TCR or US_TNCR)" mask="0x00000010" name="ENDTX"/>
          <bitfield modes="USART" caption="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000020" name="OVRE"/>
          <bitfield modes="USART" caption="Framing Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000040" name="FRAME"/>
          <bitfield modes="USART" caption="Parity Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000080" name="PARE"/>
          <bitfield modes="USART" caption="Receiver Time-out (cleared by writing a one to bit US_CR.STTTO)" mask="0x00000100" name="TIMEOUT"/>
          <bitfield modes="USART" caption="Transmitter Empty (cleared by writing US_THR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield modes="USART" caption="TX Buffer Empty (cleared by writing US_TCR or US_TNCR)" mask="0x00000800" name="TXBUFE"/>
          <bitfield modes="USART" caption="RX Buffer Full (cleared by writing US_RCR or US_RNCR)" mask="0x00001000" name="RXBUFF"/>
          <bitfield modes="USART" caption="Clear to Send Input Change Flag (cleared on read)" mask="0x00080000" name="CTSIC"/>
          <bitfield modes="USART" caption="Image of CTS Input" mask="0x00800000" name="CTS"/>
          <bitfield modes="SPI" caption="Receiver Ready (cleared by reading US_RHR)" mask="0x00000001" name="RXRDY"/>
          <bitfield modes="SPI" caption="Transmitter Ready (cleared by writing US_THR)" mask="0x00000002" name="TXRDY"/>
          <bitfield modes="SPI" caption="End of RX Buffer (cleared by writing US_RCR or US_RNCR)" mask="0x00000008" name="ENDRX"/>
          <bitfield modes="SPI" caption="End of TX Buffer (cleared by writing US_TCR or US_TNCR)" mask="0x00000010" name="ENDTX"/>
          <bitfield modes="SPI" caption="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000020" name="OVRE"/>
          <bitfield modes="SPI" caption="Transmitter Empty (cleared by writing US_THR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield modes="SPI" caption="Underrun Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000400" name="UNRE"/>
          <bitfield modes="SPI" caption="TX Buffer Empty (cleared by writing US_TCR or US_TNCR)" mask="0x00000800" name="TXBUFE"/>
          <bitfield modes="SPI" caption="RX Buffer Full (cleared by writing US_RCR or US_RNCR)" mask="0x00001000" name="RXBUFF"/>
          <bitfield modes="SPI" caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event (cleared on read)" mask="0x00080000" name="NSSE"/>
          <bitfield modes="SPI" caption="Image of NSS Line" mask="0x00800000" name="NSS"/>
        </register>
        <register caption="Receive Holding Register" name="US_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000001FF" name="RXCHR"/>
          <bitfield caption="Received Sync" mask="0x00008000" name="RXSYNH"/>
        </register>
        <register caption="Transmit Holding Register" name="US_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000001FF" name="TXCHR"/>
          <bitfield caption="Sync Field to be Transmitted" mask="0x00008000" name="TXSYNH"/>
        </register>
        <register caption="Baud Rate Generator Register" name="US_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x0000FFFF" name="CD"/>
          <bitfield caption="Fractional Part" mask="0x00070000" name="FP"/>
        </register>
        <register caption="Receiver Time-out Register" name="US_RTOR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="Time-out Value" mask="0x0000FFFF" name="TO"/>
        </register>
        <register caption="Transmitter Timeguard Register" name="US_TTGR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="Timeguard Value" mask="0x000000FF" name="TG"/>
        </register>
        <register caption="Number of Errors Register" name="US_NER" offset="0x0044" rw="R" size="4">
          <bitfield caption="Number of Errors" mask="0x000000FF" name="NB_ERRORS"/>
        </register>
